// ==UserScript==
// @name           peflnations
// @namespace      pefl
// @description    nations
// @include        http://*pefl.*/?nations
// @version        1.0
// ==/UserScript==

deb = (localStorage.debug == '1' ? true : false)
var debnum = 0

// |имя|фамилия|национальность|возраст|позиция|пенсионер|клуб|федерация|ссылка на свободного


var peflnation ={1000:'Свободные',0:'Афганистан',1:'Албания',2:'Алжир',3:'Восточное Самоа',4:'Андорра',5:'Ангола',6:'Ангуилла',7:'Антигуа',8:'Аргентина',9:'Армения',10:'Аруба',11:'Австралия',12:'Австрия',13:'Азербайджан',14:'Багамы',15:'Бахрейн',16:'Бангладеш',17:'Барбадос',18:'Беларусь',19:'Бельгия',20:'Белиз',21:'Бенин',22:'Бермуды',23:'Бутан',24:'Боливия',25:'Босния',26:'Ботсвана',27:'Бразилия',28:'Виргинские о-ва',29:'Бруней',30:'Болгария',31:'Буркина Фасо',32:'Бурунди',34:'Комбоджа',35:'Камерун',36:'Канада',37:'Кабо-Верде',38:'Каймановы о-ва',39:'ЦАР',40:'Чад',41:'Чили',42:'Китай',43:'Тайвань',44:'Колумбия',45:'Конго',46:'О-ва Кука',47:'Коста Рика',48:'Хорватия',49:'Куба',50:'Кипр',51:'Чехия',53:'Дания',54:'Джибути',55:'Доминика',56:'Доминиканская р-ка',58:'Эквадор',59:'Египет',60:'Сальвадор',61:'Англия',62:'Экв. Гвинея',63:'Эритрея',64:'Эстония',65:'Эфиопия',66:'Македония',67:'Фарерские о-ва',68:'Фиджи',69:'Финляндия',70:'Франция',71:'Габон',72:'Гамбия',73:'Грузия',74:'Германия',75:'Гана',76:'Греция',77:'Гренада',78:'Гуам',79:'Гватемала',80:'Гвинея',81:'Гвинея-Бисау',82:'Гайана',83:'Гаити',84:'Голландия',85:'Гондурас',86:'Гон-Конг',87:'Венгрия',88:'Исландия',89:'Индия',90:'Индонезия',91:'Иран',92:'Ирак',93:'Ирландия',94:'Израиль',95:'Италия',96:'Кот`д`Ивуар',97:'Ямайка',98:'Япония',99:'Иордания',100:'Казахстан',101:'Кения',102:'Кувейт',103:'Киргизия',104:'Лаос',105:'Латвия',106:'Ливан',107:'Лесото',108:'Либерия',109:'Ливия',110:'Лихтенштейн',111:'Литва',112:'Люксембург',113:'Макао',114:'Мадагаскар',115:'Малави',116:'Малайзия',117:'Мальдивы',118:'Мали',119:'Мальта',120:'Мавритания',121:'Маврикий',122:'Мексика',123:'Молдова',124:'Монголия',125:'Монсеррат',126:'Марокко',127:'Мозамбик',128:'Мьянмар',129:'Северная Ирландия',130:'Намибия',131:'Непал',132:'Кюрасао',133:'Новая Каледония',134:'Новая Зеландия',135:'Никарагуа',136:'Нигер',137:'Нигерия',138:'Северная Корея',139:'Норвегия',140:'Оман',141:'Пакистан',142:'Палестина',143:'Панама',144:'Папуа Новая Гвинея',145:'Парагвай',147:'Перу',148:'Филиппины',149:'Польша',150:'Португалия',151:'Пуэрто-Рико',152:'Катар',153:'ДР Конго',154:'Румыния',155:'Россия',156:'Руанда',157:'Зап. Самоа',158:'Сан-Марино',159:'Томе',160:'Саудовская Аравия',161:'Шотландия',162:'Сенегал',163:'Сейшельские о-ва',164:'Сьерра-Леоне',165:'Сингапур',166:'Словакия',167:'Словения',168:'Соломоновы о-ва',169:'Сомали',170:'ЮАР',171:'Южная Корея',172:'Испания',173:'Шри-Ланка',174:'Сент-Киттс',175:'Лусия',176:'Сент-Винсент',177:'Судан',178:'Суринам',179:'Свазиленд',180:'Швеция',181:'Швейцария',182:'Сирия',184:'Таджикистан',185:'Танзания',186:'Таиланд',188:'Того',189:'Тонга',190:'Тринидад и Тобаго',191:'Тунис',192:'Турция',193:'Туркменистан',194:'Каикос',195:'ОАЭ',196:'США',199:'Уганда',200:'Украина',201:'Уругвай',202:'Узбекистан',203:'Вануату',204:'Венесуэла',205:'Вьетнам',207:'Уэльс',208:'Йемен',209:'Сербия',153:'Заир',211:'Замбия',212:'Зимбабве',213:'Гваделупа',214:'Черногория',215:'Коморские острова',216:'Таити'}

var nations = []

$().ready(function() {
	$('td.back4').html('<br>Запустились...<br>')
	for (i in peflnation) {
		nations[i] = {}
		nations[i].id = i
		nations[i].name = peflnation[i]
		nations[i].pnum = 0
		nations[i].pensnum = 0
	}

	$.get('desmond_jim.php', {}, function(dt){
		var data = dt.split('|')
		$('td.back4').append('Скачали файл...<br>Начали обработку...<br><b>Игроков</b>: <span id=pl>0...</span><br>')
		var num = 0
		for (i=1; i<data.length;i=i+9){
			num++
			if(num<10) $('td.back4').append('DEBUGpl'+num+':'+data[i]+':'+data[i+1]+':'+data[i+2]+':'+data[i+3]+':'+data[i+4]+':'+data[i+5]+':'+data[i+6]+':'+data[i+7]+':'+data[i+8]+'.<br>')
			//var n_fname = i
			//var n_sname = i+1
			//var n_pnation = i+2
			var age = data[i+3]
			//var n_position = i+4
			var pensioner = (data[i+5]==1 ? true : false)
			//var n_tid = i+6
			var nid = (data[i+7]!='' ? data[i+7] : 1000)
			//var n_freelink = i+8

			nations[nid].pnum++
			if(pensioner) nations[nid].pensnum++
			$('span#pl').html(num+'...')
		}
		$('span#pl').html(num+' done.')
		PrintRes()
	})
})
function PrintRes(){
	$('td.back4').append('<br><b>Nations</b>:<br><table id=nat border=1 width=50%><tr><td>id</td><td>Страна</td><td>Игроков</td><td>Пенсов</td></tr></table>')
	for (i in nations){
		var ni = nations[i]
		var html = '<tr>'
		html += '<td>'+ni.id+'</td>'
		html += '<td>'+ni.name+'</td>'
		html += '<td>'+(ni.pnum!=0 ? ni.pnum : ' ')+'</td>'
		html += '<td>'+(ni.pensnum!=0 ? ni.pensnum : ' ')+'</td>'
		html += '</tr>'
		if(nations[i].pnum != 0) $('table#nat').append(html)
	}
}

function debug(text) {if(deb) {debnum++;$('td.back4').append(debnum+'&nbsp;\''+text+'\'<br>');}}